# Remove duplicate data

In [2]:
import pandas as pd

In [4]:
df = pd.DataFrame({'c1': ['one','one','one','one','two','two','two'], 'c2':[1,1,2,2,3,3,4]})
df

    c1  c2
0  one   1
1  one   1
2  one   2
3  one   2
4  two   3
5  two   3
6  two   4

# drop duplicate along whole row

In [5]:
df.drop_duplicates()

    c1  c2
0  one   1
2  one   2
4  two   3
6  two   4

# drop duplicate with respect to perticular column

In [6]:
df.drop_duplicates(['c1'])

    c1  c2
0  one   1
4  two   3

In [7]:
df.drop_duplicates(['c2'])

    c1  c2
0  one   1
2  one   2
4  two   3
6  two   4

In [8]:
df.drop_duplicates(['c1','c2'])

    c1  c2
0  one   1
2  one   2
4  two   3
6  two   4